ZW Provision Plan

Terraform will perform the following actions:

  # module.aws.aws_ssm_parameter.main_group["CHAT_WORKFLOW_SID"] must be replaced
-/+ resource "aws_ssm_parameter" "main_group" {
      ~ arn            = "arn:aws:ssm:us-east-1:712893914485:parameter/PROD_TWILIO_ZW_CHAT_WORKFLOW_SID" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ description    = "Twilio account - Chat transfer workflow SID" -> (known after apply)
      ~ id             = "PROD_TWILIO_ZW_CHAT_WORKFLOW_SID" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "PROD_TWILIO_ZW_CHAT_WORKFLOW_SID" # forces replacement -> (known after apply) # forces replacement
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.aws.aws_ssm_parameter.main_group["SURVEY_WORKFLOW_SID"] must be replaced
-/+ resource "aws_ssm_parameter" "main_group" {
      ~ arn            = "arn:aws:ssm:us-east-1:712893914485:parameter/PROD_TWILIO_ZW_SURVEY_WORKFLOW_SID" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ description    = "Twilio account - Survey Workflow SID" -> (known after apply)
      ~ id             = "PROD_TWILIO_ZW_SURVEY_WORKFLOW_SID" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "PROD_TWILIO_ZW_SURVEY_WORKFLOW_SID" # forces replacement -> (known after apply) # forces replacement
      - tags           = {} -> null
      ~ tags_all       = {} -> (known after apply)
      ~ tier           = "Standard" -> (known after apply)
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_chat_workflow_sid will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_chat_workflow_sid" {
        id             = "/production/twilio/ACd0db81cffec7eb658f6ee176a06dc902/chat_workflow_sid"
      + insecure_value = (known after apply)
        name           = "/production/twilio/ACd0db81cffec7eb658f6ee176a06dc902/chat_workflow_sid"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/twilio/ACd0db81cffec7eb658f6ee176a06dc902/chat_workflow_sid"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_conversations_chat_transfer_workflow_sid will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_conversations_chat_transfer_workflow_sid" {
        id             = "/production/twilio/ACd0db81cffec7eb658f6ee176a06dc902/conversations_chat_transfer_workflow_sid"
      + insecure_value = (known after apply)
        name           = "/production/twilio/ACd0db81cffec7eb658f6ee176a06dc902/conversations_chat_transfer_workflow_sid"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/twilio/ACd0db81cffec7eb658f6ee176a06dc902/conversations_chat_transfer_workflow_sid"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.aws.aws_ssm_parameter.twilio_survey_workflow_sid will be updated in-place
  ~ resource "aws_ssm_parameter" "twilio_survey_workflow_sid" {
        id             = "/production/twilio/ACd0db81cffec7eb658f6ee176a06dc902/survey_workflow_sid"
      + insecure_value = (known after apply)
        name           = "/production/twilio/ACd0db81cffec7eb658f6ee176a06dc902/survey_workflow_sid"
        tags           = {
            "Environment" = "production"
            "Name"        = "/production/twilio/ACd0db81cffec7eb658f6ee176a06dc902/survey_workflow_sid"
            "Terraform"   = "true"
        }
      ~ value          = (sensitive value)
      ~ version        = 1 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["master"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode(
          ~ {
              ~ task_routing = {
                  ~ filters = [
                      ~ {
                          ~ expression           = "channelType =='web'  OR isContactlessTask == true OR  twilioNumber == 'messenger:123236277715368'" -> "channelType IN ['web', 'messenger']  OR isContactlessTask == true OR  twilioNumber == 'messenger:123236277715368'"
                            # (2 unchanged attributes hidden)
                        },
                        {
                            expression           = "aseloHostId == 'zw1'"
                            filter_friendly_name = "Harare AC"
                            targets              = [
                                {
                                    expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                    queue      = "WQbf11936b927505e288154cc63104bfca"
                                },
                            ]
                        },
                        # (1 unchanged element hidden)
                    ]
                }
            }
        )
        id                       = "WSfde7e37d78e8dcfc14308193b90e63e7/WW3718e0ead07d771e5e3ab23f8a389152"
        # (4 unchanged attributes hidden)
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["queue_transfers"] will be created
  + resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      + assignment_callback_url          = (known after apply)
      + configuration                    = jsonencode(
            {
              + task_routing = {
                  + filters = [
                      + {
                          + expression           = "transferTargetType == 'queue' AND targetSid == 'WQ87e4644208d23debddb4f0ddf04d891f'"
                          + filter_friendly_name = "bulawayo"
                          + targets              = [
                              + {
                                  + expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  + queue      = "WQ87e4644208d23debddb4f0ddf04d891f"
                                },
                            ]
                        },
                      + {
                          + expression           = "transferTargetType == 'queue' AND targetSid == 'WQc317f44e69281acadd1950ae5b42e894'"
                          + filter_friendly_name = "e2e_test"
                          + targets              = [
                              + {
                                  + expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  + queue      = "WQc317f44e69281acadd1950ae5b42e894"
                                },
                            ]
                        },
                      + {
                          + expression           = "transferTargetType == 'queue' AND targetSid == 'WQbf11936b927505e288154cc63104bfca'"
                          + filter_friendly_name = "harare"
                          + targets              = [
                              + {
                                  + expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  + queue      = "WQbf11936b927505e288154cc63104bfca"
                                },
                            ]
                        },
                      + {
                          + expression           = "transferTargetType == 'queue' AND targetSid == 'WQe1580a16e12409ddf642f0b5a61b852c'"
                          + filter_friendly_name = "master"
                          + targets              = [
                              + {
                                  + expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  + queue      = "WQe1580a16e12409ddf642f0b5a61b852c"
                                },
                            ]
                        },
                      + {
                          + expression           = "transferTargetType == 'queue' AND targetSid == 'WQ278560f53ad61680dfd360a169c74d28'"
                          + filter_friendly_name = "survey"
                          + targets              = [
                              + {
                                  + expression = "(worker.waitingOfflineContact != true AND ((task.channelType == 'voice' AND worker.channel.chat.assigned_tasks == 0) OR (task.channelType != 'voice' AND worker.channel.voice.assigned_tasks == 0)) AND ((task.transferTargetType == 'worker' AND task.targetSid == worker.sid) OR (task.transferTargetType != 'worker' AND worker.sid != task.ignoreAgent))) OR (worker.waitingOfflineContact == true AND task.targetSid == worker.sid AND task.isContactlessTask == true)"
                                  + queue      = "WQe1580a16e12409ddf642f0b5a61b852c"
                                },
                            ]
                        },
                    ]
                }
            }
        )
      + fallback_assignment_callback_url = (known after apply)
      + friendly_name                    = "Queue Transfers Workflow"
      + id                               = (known after apply)
      + re_evaluate_tasks                = (known after apply)
      + sid                              = (known after apply)
      + task_reservation_timeout         = (known after apply)
      + workspace_sid                    = "WSfde7e37d78e8dcfc14308193b90e63e7"
    }

  # module.taskRouter.twilio_taskrouter_workspaces_workflows_v1.workflow["survey"] will be updated in-place
  ~ resource "twilio_taskrouter_workspaces_workflows_v1" "workflow" {
      ~ configuration            = jsonencode( # whitespace changes
            {
                task_routing = {
                    filters = [
                        {
                            expression           = "isChatCaptureControl==true"
                            filter_friendly_name = "CaptureChannel"
                            targets              = [
                                {
                                    queue = "WQ278560f53ad61680dfd360a169c74d28"
                                },
                            ]
                        },
                    ]
                }
            }
        )
        id                       = "WSfde7e37d78e8dcfc14308193b90e63e7/WWe8806e65585e53bf3ee172a8dc713032"
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 5 to change, 2 to destroy.

Changes to Outputs:
  ~ task_router_master_workflow_sid       = "WW3718e0ead07d771e5e3ab23f8a389152" -> (known after apply)
  ~ task_router_workflow_sids             = {
      ~ master          = "WW3718e0ead07d771e5e3ab23f8a389152" -> (known after apply)
      + queue_transfers = (known after apply)
      ~ survey          = "WWe8806e65585e53bf3ee172a8dc713032" -> (known after apply)
    }